app/views/works/show.html.erb


<% @portfolio_item.technologies.each do |t| %>
---
SELECT "technologies".* FROM "technologies" WHERE "technologies"."work_id" = $1  [["work_id", 4]]