app/controllers/blogs_controller.rb

SELECT  "blogs".* FROM "blogs" LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "blogs"
---
  def index
    @blogs = Blog.page(params[:page]).per(5)

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @blog = Blog.friendly.find(params[:id])

INSERT INTO "blogs" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "first blog post"], ["body", "this is the first blog post! Hello nerd-ld!"], ["created_at", "2019-11-16 19:12:28.477945"], ["updated_at", "2019-11-16 19:12:28.477945"]]
---
  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save

UPDATE "blogs" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "blogs"."id" = $4
---
  def update
    respond_to do |format|
      if @blog.update(blog_params)

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_blog
      @blog = Blog.friendly.find(params[:id])