app/controllers/works_controller.rb

	def index
		@portfolio_items = Work.all
---
SELECT "works".* FROM "works" ORDER BY position ASC

	def create
    @portfolio_item = Work.new(work_params)

    respond_to do |format|
      if @portfolio_item.save
---
INSERT INTO "works" ("title", "subtitle", "body", "main_img", "thumb_img", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def edit
    @portfolio_item = Work.find(params[:id])
---
SELECT  "works".* FROM "works" WHERE "works"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]

  def update
    @portfolio_item = Work.find(params[:id])

    respond_to do |format|
      if @portfolio_item.update(work_params)
---
SELECT  "works".* FROM "works" WHERE "works"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "works" SET "subtitle" = $1, "updated_at" = $2 WHERE "works"."id" = $3  [["subtitle", "Subtitle for a work of great beauty :)"], ["updated_at", "2019-12-08 01:30:19.724173"], ["id", 10]]

  def show
    @portfolio_item = Work.find(params[:id])
---
SELECT  "works".* FROM "works" WHERE "works"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def destroy
    # this performs lookup
    @portfolio_item = Work.find(params[:id])
    work_title = @portfolio_item.title

    #this destroys the record
    @portfolio_item.destroy
---
SELECT  "works".* FROM "works" WHERE "works"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "works" WHERE "works"."id" = $1  [["id", 1]]